<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"059f80feb1da415888000ff22fb3d2ae3e134b8ee0315333da5d21d5201787aa","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1671 at https://github.com/cal-itp/data-infra/actions/runs/23355410105","plan_out_hash":"d245f33d2c7c5d6aae9688c3118343d51052e33a2c2ac83e1a0a42d4296a108f","plan_hash":"e0707620c7e897fa4b46411b5573025dd6314741234691d57c874935c71f54b8","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/transit_database_latest/dim_organizations_latest_with_caltrans_district.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Av5BDQ==" -> (known after apply)
!~      detect_md5hash      = "0P8N/tiYqgp+q4X5tYFztg==" -> "different hash"
!~      generation          = 1749663117930277 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/transit_database_latest/dim_organizations_latest_with_caltrans_district.sql"
!~      md5hash             = "0P8N/tiYqgp+q4X5tYFztg==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database_latest/dim_organizations_latest_with_caltrans_district.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/transit_database_latest/dim_services_latest.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "GYtdyQ==" -> (known after apply)
!~      detect_md5hash      = "u0XGOeED3z2Vj+/KCAXGSg==" -> "different hash"
!~      generation          = 1773865162279930 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/transit_database_latest/dim_services_latest.sql"
!~      md5hash             = "u0XGOeED3z2Vj+/KCAXGSg==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database_latest/dim_services_latest.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1671](https://github.com/cal-itp/data-infra/actions/runs/23355410105)